tap "shivammathur/php"
tap "symfony-cli/tap"
tap "tabbyml/tabby"
tap "teamookla/speedtest"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Parser generator
brew "bison"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@77"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Shell command parallelization utility
brew "parallel"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Object-relational database system
brew "postgresql@14"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Visualize data generated by Cachegrind and Calltree
brew "qcachegrind"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Tabby: AI Coding Assistant
brew "tabbyml/tabby/tabby"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# App for managing battery charging. (Also installs a CLI on first use.)
cask "battery"
# Terminal-based AI coding assistant
cask "claude-code"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Android file transfer
cask "openmtp"
# Replacement for Docker Desktop
cask "orbstack"
