tap "shivammathur/php"
tap "symfony-cli/tap"
tap "tabbyml/tabby"
tap "teamookla/speedtest"
brew "asdf"
brew "bison"
brew "curl"
brew "php"
brew "composer"
brew "e2fsprogs"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "go"
brew "goaccess"
brew "graphviz"
brew "htop"
brew "icu4c@77"
brew "jq"
brew "k6"
brew "lazydocker"
brew "lazygit"
brew "make"
brew "maven"
brew "ncdu"
brew "neovim"
brew "node"
brew "parallel"
brew "pkgconf"
brew "postgresql@14"
brew "python@3.13"
brew "qcachegrind"
brew "re2c"
brew "ripgrep"
brew "ruff"
brew "shfmt"
brew "taplo"
brew "telnet"
brew "thefuck"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "wget"
brew "xq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "tabbyml/tabby/tabby"
brew "teamookla/speedtest/speedtest"
cask "battery"
cask "claude-code"
cask "gstreamer-runtime"
cask "openmtp"
cask "orbstack"
go "github.com/air-verse/air"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "github.com/ramya-rao-a/go-outline"
go "github.com/mdempsky/gocode"
go "github.com/kisielk/godepgraph"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "github.com/uudashr/gopkgs/v2/cmd/gopkgs"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
go "github.com/a-h/templ/cmd/templ"
